{
    "architectures": [
        "Qwen3ForCausalLMCustom"
    ],
    "model_type": "qwen3",
    "use_custom_logic": true,
    "auto_map": {
        "AutoConfig": "configuration_qwen3.Qwen3Config",
        "AutoModelForCausalLM": "modeling_qwen3.Qwen3ForCausalLMCustom"
    },
    "torch_dtype": "bfloat16",
    "vocab_size": 176384,
    "hidden_size": 4096,
    "intermediate_size": 22016,
    "num_hidden_layers": 32,
    "num_attention_heads": 32,
    "num_key_value_heads": 32,
    "max_position_embeddings": 32768,
    "rms_norm_eps": 1e-06,
    "tie_word_embeddings": false,
    "rope_parameters": {
        "rope_type": "default",
        "rope_theta": 1000000.0
    }
}